#include <iostream>
#include <math.h>
#include "locale.h"

using namespace std;

// 1. Дано целое число. Если оно является положительным, то прибавить к нему 1, в противном
// случае не изменять его. Вывести полученное число.
void task1() 
{
    int number;
    setlocale(0, "rus");
    cout << "Введите целое число:";
    cin >> number;
    
    if(number > 0) 
    {
        number += 1;
    }
    cout << "Число: " << number;
}

// ========================================================================== //

// 2. Дано целое число. Если оно является нечетным положительным, то прибавить к нему 1, если отрицательным, 
// то вычесть из него 2, если нулевым, то заменить его на 10. Вывести полученное число.
void task2() 
{
    int number;
    setlocale(0, "rus");
    cout << "Введите целое число:";
    cin >> number;
    
    if(number > 0 && number % 2 == 1 ) 
    {
        number += 1;
    } 
        else if (number < 0) 
    {
        number -= 2;
    } 
        else if (number == 0) 
    {
        number = 10;
    }
    cout << "Число:" << number;
}

// ========================================================================== //

// 3. Введите два целых числа и сравните эти числа. Программа должна вывести сначала первое введенное число, 
// затем символ (>, < или =) в зависимости от значений переменных и в конце второе число.
void task3() 
{
    int x1, x2;
    setlocale(0, "rus");
    cout << "Введите первое число:";
    cin >> x1;
    
    cout << "Введите второе число:";
    cin >> x2;
    
    if(x1 > x2) {
        cout << x1 << " > " << x2;
    } else if (x1 < x2) {
        cout << x1 << " < " << x2;
    } else if (x1 == x2) {
       cout << x1 << " = " << x2;
    }
}

// ========================================================================== //

// 4. Введите 3 целых числа и определите наименьшее и наибольшее из них; посчитайте сумму, произведение и среднее значение введенных чисел.
void task4() 
{
    int x1, x2, x3, max, min, s, p, middle;
    setlocale(0, "rus");
    cout << "Введите первое число:";
    cin >> x1;

    cout << "Введите второе число:";
    cin >> x2;
    
    cout << "Введите третье число:";
    cin >> x3;
    
    max = x1;
    if(x2 > max) max = x2;
    if(x3 > max) max = x3;
    
    min = x1;
    if(x2 < min) min = x2;
    if(x3 < min) min = x3;
    
    s = x1 + x2 + x3;
    p = x1 * x2 * x3;
    middle = (x1 + x2 + x3) / 3;
    
    cout << "Найбольшее: " << max << endl;
    cout << "Найменьшее: " << min << endl;
    cout << "Сумма: " << s << endl;
    cout << "Произведение: " << p << endl;
    cout << "Среднее значение: " << middle;
}

// ========================================================================== //

// 5. Напишите программу, которая расположит три введенных числа в порядке возрастания.
void task5() 
{
    int x1, x2, x3, min, middle, max;
    setlocale(0, "rus");
    cout << "Введите первое число:";
    cin >> x1;
    
    cout << "Введите второе число:";
    cin >> x2;
    
    cout << "Введите третье число:";
    cin >> x3;
    
    max = x1;
    if(x2 > max) max = x2;
    if(x3 > max) max = x3;
    
    min = x1;
    if(x2 < min) min = x2;
    if(x3 < min) min = x3;
    
    middle = x1;
    if(max > x2 && x2 > min) middle = x2;
    if(max > x3 && x3 > min) middle = x3;
    
    cout << "Числа в порядке возрастания: " << min << " " << middle << " " << max;
}

// ========================================================================== //

// 6. Введите число, если число > 60, то выводим отлично, если число больше 30 и меньше 60, то выводим хорошо, если число больше 17 и меньше 30, 
// то выводим удовлетворительно, если число меньше 17, то выводим плохо (использовать вложенные операторы else/if)
void task6() {
    int number;
    setlocale(0, "rus");
    cout << "Введите число:";
    cin >> number;
    
    if(number > 60) 
    {
        cout << "Отлично!";
    } 
    else if (number < 60 && number > 30) 
    {
        cout << "Хорошо";
    } 
    else if (number < 30 && number > 17) 
    {
        cout << "Удовлетворительно";
    } 
    else if (number < 17) 
    {
        cout << "Плохо";
    }
}

// ========================================================================== //

// 7. Программа, которая в зависимости от номера месяца выводит одно из слов: Зима, Весна, Лето или Осень.
void task7() 
{
    int number;
    setlocale(0, "rus");
    cout << "Введите номер месяца: ";
    cin >> number;
    
    if(number >= 1 && number <= 2 || number == 12) 
    {
        cout << "Зима";
    } 
    else if (number >= 3 && number <= 5) 
    {
        cout << "Весна";
    } 
    else if (number >= 6 && number <= 8) 
    {
        cout << "Лето";
    } 
    else if (number >= 9 && number <= 11) 
    {
        cout << "Осень";
    }
}

// ========================================================================== //

// 8. Даны три переменные вещественного типа: А, В, С. Если их значения упорядочены по возрастанию или убыванию, то удвойте их, 
// в противном случае замените значение каждой переменной на противоположное. Выведите новые значения переменных А, В, С.
void task8() 
{
    float A, B, C;
    setlocale(0, "rus");
    cout << "Введите A: ";
    cin >> A;
    
    cout << "Введите B: ";
    cin >> B;
    
    cout << "Введите C: ";
    cin >> C;
    
    if(A > B && B > C || C > B && B > A) 
    {
       A *= 2; 
       B *= 2; 
       C *= 2; 
    } 
    else 
    {
       A = -A; 
       B = -B; 
       C = -C;
    }
    
    cout << A << endl;
    cout << B << endl;
    cout << C;
}

// ========================================================================== //

// 9. Ввести координаты центра окружности O(хo,уo) и радиус R. Ввести также и координаты точки А(ха, уа) и определить, попадает ли данная точка в окружность или нет.
void task9() 
{
    int xo, yo, xa, ya, R;
    setlocale(0, "rus");
    cout << "Введите радиус: ";
    cin >> R;
    
    cout << "Введите xo: ";
    cin >> xo;
    
    cout << "Введите yo: ";
    cin >> yo;
    
    cout << "Введите xa: ";
    cin >> xa;
    
    cout << "Введите ya: ";
    cin >> ya;
    
    if(pow((xa - xo), 2) + pow((ya - yo), 2) < pow(R, 2)) 
    {
        cout << "Находится";
    } 
    else 
    {
        cout << "Не находится";
    }
}

// ========================================================================== //

// 10. Даны три монеты достоинством 5 000, 10 000, 20 000 рублей. Напишите программу, которая определит, можно ли заданную сумму набрать из каких либо двух монет.
void task10() 
{
    int m1 = 5000, m2 = 10000, m3 = 20000, s;
    setlocale(0, "rus");
    cout << "Введите сумму: ";
    cin >> s;
    
    if (s == m1 + m2 || s == m1 + m3 || s == m2 + m3) 
    {
        cout << "Можно";
    } 
    else 
    {
        cout << "Нельзя";
    }
}

// ========================================================================== //

// 11. Дано целое число в диапазоне 1 – 7. Вывести строку –— название дня недели, соответствующее данному числу (1 — «понедельник», 2 — «вторник» и т. д.).
void task11() 
{
    int number;
    setlocale(0, "rus");
    cout << "Введите число от 1 до 7: ";
    cin >> number;
    
    switch(number) 
    {
        case 1: cout << "Понедельник: "; break;
        case 2: cout << "Вторник: "; break;
        case 3: cout << "Среда: "; break;
        case 4: cout << "Четверг: "; break;
        case 5: cout << "Пятница: "; break;
        case 6: cout << "Суббота: "; break;
        case 7: cout << "Воскресенье: "; break;
    }
}

// ========================================================================== //

// 12. Дано целое число в диапазоне 100 – 999. Вывести строку — описание данного числа, например: 256 — «двести пятьдесят шесть», 814 — «восемьсот четырнадцать».
void task12() 
{
    int n1, n2, n3, number;
    string units, dozens, hunreds;
    setlocale(0, "rus");
    cout << "Введите число от 100 до 999: ";
    cin >> number;
    
    n1 = number % 10;
    n2 = (number % 100) / 10;
    n3 = number / 100; 
    
    switch(n1) 
    {
        case 1: units = "один"; break;
        case 2: units = "два"; break;
        case 3: units = "три"; break;
        case 4: units = "четыре"; break;
        case 5: units = "пять"; break;
        case 6: units = "шесть"; break;
        case 7: units = "семь"; break;
        case 8: units = "восемь"; break;
        case 9: units = "девять"; break;
    }
    
    switch(n2) 
    {
        case 1: dozens = "десять "; break;
        case 2: dozens = "двадцать "; break;
        case 3: dozens = "тридцать "; break;
        case 4: dozens = "сорок "; break;
        case 5: dozens = "пятьдесят "; break;
        case 6: dozens = "шестьдесят "; break;
        case 7: dozens = "семьдесят "; break;
        case 8: dozens = "восемьдесят "; break;
        case 9: dozens = "девяносто "; break;
    }
    
    switch(n3) 
    {
        case 1: hunreds = "сто "; break;
        case 2: hunreds = "двести "; break;
        case 3: hunreds = "триста "; break;
        case 4: hunreds = "четыреста "; break;
        case 5: hunreds = "пятьсот "; break;
        case 6: hunreds = "шестьсот "; break;
        case 7: hunreds = "семьсот "; break;
        case 8: hunreds = "восемьсот "; break;
        case 9: hunreds = "девятьсот "; break;
    }
    cout << hunreds << dozens << units;
}

// ========================================================================== //

// 13. Мастями игральных карт присвоены порядковые номера: 1 — пики, 2 — трефы, 3 — бубны, 4 — черви. 
// Достоинству карт, старше десятки, присвоены номера: 11 — валет, 12 — дама, 13 — король, 14 — туз. 
// Даны два целых числа: N — достоинство (от 6 до 14) и М — масть карты (от 1 до 4). 
// Вывести название соответствующей карты вида «бубновая шестерка», «червовая дама», «трефовый туз» и т. п.
void task13() 
{
    int N, M;
    string dignity, suit;
    setlocale(0, "rus");
    cout << "Введите достоинство: ";
    cin >> N;
    
    cout << "Введите масть: ";
    cin >> M;
    
    switch(N) 
    {
        case 1: dignity = "пика "; break;
        case 2: dignity = "трефа "; break;
        case 3: dignity = "бубна "; break;
        case 4: dignity = "черва "; break;
    }
    
    switch(M) 
    {
        case 6: suit = "шестерка"; break;
        case 7: suit = "семерка"; break;
        case 8: suit = "восьмерка"; break;
        case 9: suit = "девятка"; break;
        case 10: suit = "десятка"; break;
        case 11: suit = "валет"; break;
        case 12: suit = "дама"; break;
        case 13: suit = "король"; break;
        case 14: suit = "туз"; break;
    }
    cout << dignity << suit;
}

// ========================= // 
// © Ilya Goncharov, 211701c //
// ========================= //